In [1]:
#Dataframe is a two dimensionalstructure, consider it as a two dimensional Series,

In [2]:
#Creating a data frame from Series:

#Lets create three records:

import pandas as pd
record1 = pd.Series({'Name':'Alice','Class':'Chemistry','Score':80})

In [3]:
record2 = pd.Series({'Name':'Bob','Class':'Physics','Score':90})

In [4]:
record3 = pd.Series({'Name':'Sam','Class':'Maths','Score':'65'})

In [7]:
df = pd.DataFrame([record1,record2,record3],index=['school1','school2','school1'])

In [8]:
df

          Name      Class Score
school1  Alice  Chemistry    80
school2    Bob    Physics    90
school1    Sam      Maths    65

In [9]:
#Accessing the objects of a dataframe:

df.loc['school1'] #using the loc function we can access it justlike series with the index name

          Name      Class Score
school1  Alice  Chemistry    80
school1    Sam      Maths    65

In [11]:
df.iloc[1] #accessing by index position(returns second row)

Name         Bob
Class    Physics
Score         90
Name: school2, dtype: object

In [13]:
df.loc['Name'] #cannot access column name using loc; only index names can be accessed.

KeyError: 'Name'

In [14]:
df

          Name      Class Score
school1  Alice  Chemistry    80
school2    Bob    Physics    90
school1    Sam      Maths    65

In [17]:
df.loc['school2'] #check type of this and it will return Series

type(df.loc['school2'])

pandas.core.series.Series

In [18]:
#accessing all names in school1:

df.loc['school1']['Name'] #returns names of all students in school1

school1    Alice
school1      Sam
Name: Name, dtype: object

In [21]:
df.loc['school1','Name'] #another way to get names of al students in school 1

school1    Alice
school1      Sam
Name: Name, dtype: object

In [24]:
#transpoing a dataframe
#Suppose if we want to get all the names of all students:
#one way is to transpose the data set and then use loc:

df.T.loc['Name'] #transpose and then use indx methods loc and iloc

school1    Alice
school2      Bob
school1      Sam
Name: Name, dtype: object

In [26]:
##Another way:

df.loc[:,'Name'] #returns all names:  Colon specifies you need all indices(or all rows)

school1    Alice
school2      Bob
school1      Sam
Name: Name, dtype: object

In [27]:
df['Name'] #or directly use the column name(just like select in sql)

school1    Alice
school2      Bob
school1      Sam
Name: Name, dtype: object

In [29]:
#names and scores of all students:

df[['Name','Score']]

          Name Score
school1  Alice    80
school2    Bob    90
school1    Sam    65

In [30]:
df.loc['school1',['Name','Score']]#name and score of all students from school1

          Name Score
school1  Alice    80
school1    Sam    65

In [35]:
#create a copy of the dataframe:

df_copy = df.copy()
df_copy

          Name      Class Score
school1  Alice  Chemistry    80
school2    Bob    Physics    90
school1    Sam      Maths    65

In [36]:
print(df_copy)

          Name      Class Score
school1  Alice  Chemistry    80
school2    Bob    Physics    90
school1    Sam      Maths    65

In [37]:
df_copy.loc['school1']

          Name      Class Score
school1  Alice  Chemistry    80
school1    Sam      Maths    65

In [38]:
#now if we want to drop school1 data:

df_copy.drop('school1')

        Name    Class Score
school2  Bob  Physics    90

In [39]:
#it shows that the school1 data is dropped, it is actually not dropped in the original dataframe, it just shows the result:

df_copy #data is still intact

          Name      Class Score
school1  Alice  Chemistry    80
school2    Bob    Physics    90
school1    Sam      Maths    65

In [44]:
#now we can also drop the data in place and it will reflect in the dataframe:

df_copy.drop(['Name'],axis=1,inplace=True) #also ifwe need to delete a column then axis needs to be 1

In [45]:
df_copy #the column is dropped

             Class Score
school1  Chemistry    80
school2    Physics    90
school1      Maths    65

In [46]:
#another way of dropping data is using del keyword; this takes immediate effect and doesnt require inplace parameter:

del df_copy['Score']

In [47]:
df_copy #drpped column score

             Class
school1  Chemistry
school2    Physics
school1      Maths

In [48]:
#adding new column to a dataframe:

df_copy['class_ranking']= None

df_copy #added a column with default value None

             Class class_ranking
school1  Chemistry          None
school2    Physics          None
school1      Maths          None